      *    Die Eingabe-Variablen zur Dimension und Abbruchkriterien
           01 ABBRUCH.
               05 N PIC 9(06) COMP-3.
               05 EPSILON PIC 9V9(16) COMP-3.
               05 ERRORMSG PIC X(80).
               05 RET-EW Pic S9(06)V9(16) COMP-3.
