           01 INPUT-VEKTOR.
      *        Input-Vector
               05 DIM-I PIC 9(04) COMP-3.
               05 XI PIC S9(06)V9(16)
                       OCCURS 1 TO 1000 DEPENDING ON DIM-I COMP-3.
